agenda.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-15 Wed 15:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Schedules</title>
<meta name="author" content="于承业" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="latexcss/latexcss.css" />
<link rel="stylesheet" type="text/css" href="../latexcss/latexcss.css" />
<link rel="alternate stylesheet" type="https://orgmode.org/resources/style/org-demo.min.css" />
<link rel="alternate stylesheet" type="../latexcss/latexcss.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Schedules</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbbc44ee">1. Here is my TODO list</a>
<ul>
<li><a href="#org9d27b2d">1.1. DBMS</a>
<ul>
<li><a href="#orgd99117d">1.1.1. <span class="todo TODO">TODO</span> implement WiscKey on leveldb</a></li>
<li><a href="#org31ff6c8">1.1.2. <span class="todo TODO">TODO</span> Classic BTree implementation</a></li>
</ul>
</li>
<li><a href="#org0361c6d">1.2. Rust</a>
<ul>
<li><a href="#org74ef4a1">1.2.1. <span class="done DONE">DONE</span> Better Lisp interpretre</a></li>
<li><a href="#orgb711304">1.2.2. <span class="todo TODO">TODO</span> LC-3 Arch Virtual Machine</a></li>
<li><a href="#org4c5436a">1.2.3. <span class="done DEPRECATED">DEPRECATED</span> Chip-8 Emulator</a></li>
</ul>
</li>
<li><a href="#org346d8bd">1.3. C++</a>
<ul>
<li><a href="#org628c940">1.3.1. <span class="done DEPRECATED">DEPRECATED</span> Joblib(async/await)</a></li>
<li><a href="#org0ed5cc3">1.3.2. <span class="done DONE">DONE</span> Mininal Lisp interpreter</a></li>
</ul>
</li>
<li><a href="#orge54306c">1.4. Lisp</a>
<ul>
<li><a href="#orgca556c7">1.4.1. <span class="todo TODO">TODO</span> Coroutine in Scheme/CL</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="./index.html">Back to index</a>
</p>

<div id="outline-container-orgbbc44ee" class="outline-2">
<h2 id="orgbbc44ee"><span class="section-number-2">1.</span> Here is my TODO list</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9d27b2d" class="outline-3">
<h3 id="org9d27b2d"><span class="section-number-3">1.1.</span> DBMS</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgd99117d" class="outline-4">
<h4 id="orgd99117d"><span class="section-number-4">1.1.1.</span> <span class="todo TODO">TODO</span> implement WiscKey on leveldb</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> read leveldb source code</li>
<li class="off"><code>[&#xa0;]</code> value log
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> write buffer</li>
<li class="off"><code>[&#xa0;]</code> garbage collection</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org31ff6c8" class="outline-4">
<h4 id="org31ff6c8"><span class="section-number-4">1.1.2.</span> <span class="todo TODO">TODO</span> Classic BTree implementation</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> LMDB source code</li>
<li class="off"><code>[&#xa0;]</code> WiredTiger btree</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0361c6d" class="outline-3">
<h3 id="org0361c6d"><span class="section-number-3">1.2.</span> Rust</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org74ef4a1" class="outline-4">
<h4 id="org74ef4a1"><span class="section-number-4">1.2.1.</span> <span class="done DONE">DONE</span> Better Lisp interpretre</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>State "DONE"       from "JACKING IN" <span class="timestamp-wrapper"><span class="timestamp">[2023-03-15 Wed 15:30] </span></span> <br />
see rlisp</li>
<li class="on"><code>[X]</code> Mininal impl(same as ILisp)</li>
<li class="on"><code>[X]</code> quote/setq/lambda</li>
<li class="off"><code>[&#xa0;]</code> complex types</li>
</ul>
</div>
</div>
<div id="outline-container-orgb711304" class="outline-4">
<h4 id="orgb711304"><span class="section-number-4">1.2.2.</span> <span class="todo TODO">TODO</span> LC-3 Arch Virtual Machine</h4>
</div>
<div id="outline-container-org4c5436a" class="outline-4">
<h4 id="org4c5436a"><span class="section-number-4">1.2.3.</span> <span class="done DEPRECATED">DEPRECATED</span> Chip-8 Emulator</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>State "DEPRECATED" from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2023-03-15 Wed 15:30]</span></span></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org346d8bd" class="outline-3">
<h3 id="org346d8bd"><span class="section-number-3">1.3.</span> C++</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org628c940" class="outline-4">
<h4 id="org628c940"><span class="section-number-4">1.3.1.</span> <span class="done DEPRECATED">DEPRECATED</span> Joblib(async/await)</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>State "DEPRECATED" from "JACKING IN" <span class="timestamp-wrapper"><span class="timestamp">[2023-03-15 Wed 15:31]</span></span></li>
<li class="on"><code>[X]</code> Stackless &amp; Stackful coroutine</li>
<li class="off"><code>[&#xa0;]</code> Multi-thread scheduling</li>
<li class="off"><code>[&#xa0;]</code> <p>
asyncio
</p>

<p>
see pco
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org0ed5cc3" class="outline-4">
<h4 id="org0ed5cc3"><span class="section-number-4">1.3.2.</span> <span class="done DONE">DONE</span> Mininal Lisp interpreter</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li><p>
State "DONE"       from "DONE"       <span class="timestamp-wrapper"><span class="timestamp">[2021-12-04 Sat 02:03] </span></span> <br />
Git repo: <a href="https://github.com/kabu1204/ILisp">ILisp</a>
</p>

<p>
Memo: <a href="https://mp.weixin.qq.com/s/lM-R7T3fzYL5OvBhK2Et8w">A C++ implementation of Lisp interpreter</a>
</p></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge54306c" class="outline-3">
<h3 id="orge54306c"><span class="section-number-3">1.4.</span> Lisp</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgca556c7" class="outline-4">
<h4 id="orgca556c7"><span class="section-number-4">1.4.1.</span> <span class="todo TODO">TODO</span> Coroutine in Scheme/CL</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 于承业</p>
<p class="date">Created: 2023-03-15 Wed 15:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
